virt/test.txt
mytest: (g=0): rw=randrw, bs=(R) 4096B-4096B, (W) 4096B-4096B, (T) 4096B-4096B, ioengine=libaio, iodepth=1
fio-3.12
Starting 1 process

mytest: (groupid=0, jobs=1): err= 0: pid=24343: Tue Apr 16 16:45:14 2024
  read: IOPS=19.2k, BW=75.0MiB/s (78.7MB/s)(512MiB/6824msec)
    slat (usec): min=29, max=8356, avg=49.04, stdev=24.55
    clat (nsec): min=233, max=5376, avg=258.05, stdev=26.76
     lat (usec): min=29, max=8358, avg=49.36, stdev=24.56
    clat percentiles (nsec):
     |  1.00th=[  243],  5.00th=[  247], 10.00th=[  249], 20.00th=[  253],
     | 30.00th=[  255], 40.00th=[  255], 50.00th=[  258], 60.00th=[  258],
     | 70.00th=[  262], 80.00th=[  262], 90.00th=[  266], 95.00th=[  270],
     | 99.00th=[  302], 99.50th=[  314], 99.90th=[  334], 99.95th=[  406],
     | 99.99th=[ 1672]
   bw (  KiB/s): min=62408, max=79112, per=99.79%, avg=76652.46, stdev=4859.33, samples=13
   iops        : min=15602, max=19778, avg=19163.08, stdev=1214.82, samples=13
  write: IOPS=19.2k, BW=75.0MiB/s (78.7MB/s)(512MiB/6824msec); 0 zone resets
    slat (nsec): min=964, max=90215, avg=1374.91, stdev=760.61
    clat (nsec): min=205, max=2006, avg=221.44, stdev=15.60
     lat (nsec): min=1225, max=90530, avg=1638.16, stdev=762.79
    clat percentiles (nsec):
     |  1.00th=[  211],  5.00th=[  213], 10.00th=[  215], 20.00th=[  217],
     | 30.00th=[  219], 40.00th=[  219], 50.00th=[  221], 60.00th=[  223],
     | 70.00th=[  223], 80.00th=[  225], 90.00th=[  229], 95.00th=[  233],
     | 99.00th=[  258], 99.50th=[  270], 99.90th=[  286], 99.95th=[  294],
     | 99.99th=[  652]
   bw (  KiB/s): min=62800, max=79976, per=99.64%, avg=76569.46, stdev=4702.40, samples=13
   iops        : min=15700, max=19994, avg=19142.31, stdev=1175.58, samples=13
  lat (nsec)   : 250=54.71%, 500=45.27%, 750=0.01%, 1000=0.01%
  lat (usec)   : 2=0.01%, 4=0.01%, 10=0.01%
  cpu          : usr=1.89%, sys=9.45%, ctx=131048, majf=0, minf=10
  IO depths    : 1=100.0%, 2=0.0%, 4=0.0%, 8=0.0%, 16=0.0%, 32=0.0%, >=64=0.0%
     submit    : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     complete  : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     issued rwts: total=131040,131104,0,0 short=0,0,0,0 dropped=0,0,0,0
     latency   : target=0, window=0, percentile=100.00%, depth=1

Run status group 0 (all jobs):
   READ: bw=75.0MiB/s (78.7MB/s), 75.0MiB/s-75.0MiB/s (78.7MB/s-78.7MB/s), io=512MiB (537MB), run=6824-6824msec
  WRITE: bw=75.0MiB/s (78.7MB/s), 75.0MiB/s-75.0MiB/s (78.7MB/s-78.7MB/s), io=512MiB (537MB), run=6824-6824msec

Disk stats (read/write):
  nvme0n1: ios=127499/57170, merge=0/40, ticks=5965/2391, in_queue=8360, util=97.20%